/**
 * #blog_post_info_block
 * 即支持、收藏、分享区域
 */

/*+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
                                            默认自动推荐
1. 如果停留超过一秒，则证明读者是支持我的

+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-*/
function autoClick() {
  if (g.isBlogOwner || !g.isAuthenticated) {
    return
  }
  if ($('#digg_tips').text().index('您已推荐过')) {
    // 给用户一个取消的机会，就不删掉提示文字了
    return
  }
  setTimeout(() => {
    $('.diggit').trigger('click')
  }, 1000)
}
